##  Урок третий, домашнее задание №1
# num1 = int(input('Введите число: '))
# if num1 % 2 == 0:
#     num1 = num1 + 20
# else:
#     num1 = num1 - 5
# print(num1)

# num1 = int(input('Введите число: '))
# if num1 % 2:
#     num1 = num1 - 5
# else:
#     num1 = num1 + 20
# print(num1)


##  Урок третий, домашнее задание №2
# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# if (a + b) % 5 == 0:
#     result = a + b - 1
# else:
#     result = a + b - 2
# print(result)

# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# result = a + b - 2 if (a + b) % 5 else a + b + 1
# print(result)

##  Урок третий, домашнее задание №3
# temp = float(input('Введите температуру: '))
# if temp <= 33.:
#     print('А Вы еще живы?')
# elif temp <= 36.4:
#     print('Вы больны. Обратитесь к врачу.')
# elif temp <= 36.8:
#     print('Вы совершенно здоровы.')
# elif temp <= 40.:
#     print('Вы больны, обратитесь к врачу.')
# else:
#     print('С такой температурой уже не живут... :-(')

 ### не удалось сделать пример с match case
# temp = float(input('Введите температуру: '))
# match temp:
#     case temp <= 33.:
#         print('А Вы еще живы?')

##  Урок третий, домашнее задание №4

### не получается ввести 3 значения, хотя должно было бы получиться
# temp1, temp2, temp3 = input('Введите температуру, 3 значения: ')
# print(temp1, temp2, temp3)

# temp1 = float(input('Введите первое значение температуры: '))
# temp2 = float(input('Введите второе значение температуры: '))
# temp3 = float(input('Введите третье значение температуры: '))
#
# if temp1 == 0:
#     print('Введена температура таяния льда')
# elif temp2 == 0:
#     print('Введена температура таяния льда')
# elif temp3 == 0:
#     print('Введена температура таяния льда')
# else:
#     print('Такой температуры нет')

### Опять math case не получается
#temp1 = float(input('Введите первое значение температуры: '))
#temp2 = float(input('Введите второе значение температуры: '))
#temp3 = float(input('Введите третье значение температуры: '))
#tmp = 0
#match 0:
#    case 0 == temp1:
#        print('Введена температура таяния льда')

##  Урок третий, домашнее задание №5
num1 = int(input('Введите первое число: '))
num2 = int(input('Введите второе число: '))
print(f'{num1} - четное') if num1 % 2 == 0 else print(f'{num1} - не четное')
print(f'{num2} - четное') if num2 % 2 == 0 else print(f'{num2} - не четное')






