###  Операторы цикла for/while
##  Урок четвертый, домашнее задание №1
'''
1) Составить программу, чтобы компьютер запросил имя пользователя и его год рождения,
затем подсчитал возраст человека, в зависимости от года рождения.
(использовать библиотеку datetime)
'''
from calendar import calendar
from time import sleep

# from datetime import datetime
# name = input('Введите имя: ').title()
# birth_year = input('Введите год рождения: ')
# now_year = datetime.now().strftime('%Y')
# age = int(now_year) - int(birth_year)
# print(f'{name}, Вам {age} года(лет).')

##  Урок четвертый, домашнее задание №2
'''
Напишите программу, которая принимает целое число от 1 до 12 и возвращает незвание месяца и количество дней.
(использовать match case)
'''

# month_num = input('Введите номер месяца: ')
# match month_num:
#     case '1':
#         print('Январь')
#     case '2':
#         print('Февраль')
#     case '3':
#         print('Март')
#     case '4':
#         print('Апрель')
#     case '5':
#         print('Май')
#     case '6':
#         print('Июнь')
#     case '7':
#         print('Июль')
#     case '8':
#         print('Август')
#     case '9':
#         print('Сентябрь')
#     case '10':
#         print('Октябрь')
#     case '11':
#         print('Ноябрь')
#     case '12':
#         print('Декабрь')

##  Урок четвертый, домашнее задание №3
'''
3) Написать программу, которая спрашивает у пользователя три числа
 и выводит количество совпадающих.
'''
# num1 = input('Введите первое число: ')
# num2 = input('Введите второе число: ')
# num3 = input('Введите третье число: ')
# cnt = 0

# if num1 == num2 and num1 == num3:
#     cnt = 3
# elif num1 == num2:
#     cnt = 2
# elif num1 == num3:
#     cnt = 2
# elif num2 == num3:
#     cnt = 2
# else:
#     cnt = 0
# print(cnt)

##  Урок четвертый, домашнее задание №4
'''
4) Написать программу, которая спрашивает у пользователя год и определяет является ли год високосным.
'''
# import calendar
# year = int(input('Введите год: '))
# print(f'{year} год високосный') if calendar.isleap(year) else print(f'{year} год не високосный')
'''
В календаре, каждое столетие пропускается 1 високосный год,
а каждый 400 год високосный год не пропускается. 
Пока самостоятельно не получается скомпоновать все эти условия.
'''

##  Урок четвертый, домашнее задание №5
'''
5) Шоколадка имеет вид прямоугольника, разделенного на width×length долек.
Шоколадку можно один раз разломить по прямой на две части.
Определите, можно ли таким образом отломить от шоколадки часть, состоящую ровно из x долек.
Программа получает на вход три числа: width, length, parts и должна вывести YES или NO.
'''
# width = int(input('Введите ширину: '))
# length = int(input('Введите длинну: '))
# x = int(input('Введите количество долек: '))
#
# print('YES') if x % width  == 0 or x % length == 0 else print('NO')

##  Урок четвертый, домашнее задание №6
'''
6) Составить таблицу умножения
'''
# print('\t|\t', end = '')
# for a in range(1,11):
#     print(a, end = '\t')
# print()
# print('_' * 46, end = '')
#
# for i in range(1, 11):
#     print()
#     print(f'{i}\t|\t', end='')
#     for j in range(1,11):
#         print(f'{i * j}', end = '\t')

##  Урок четвертый, домашнее задание №7
'''
7)** Создайте игру «Угадай число», программа генирирует рандомное число в заданном интервале, и предлагает пользователю угадать, игра продолжается до тех пор пока пользователь угадает число:

from random import randrange
x = randrange(1, 5) # дает рандомное число по вашему заданному диапазону  
можете изменять randrange gj по вашему желанию
'''
# from random import randrange
#
# name = input('Привет, как тебя зовут? ')
# print(f'Ваше имя: {name}')
# print(f'Что ж, {name}, я загадываю число от 1 до 5.')
# numb = int(input('Попробуй угадать: '))
#
# cnt = 0
# x = randrange(1, 6)
# while True:
#     if x > numb:
#         cnt += 1
#         print('Твое число слишком маленькое')
#         numb = int(input('Попробуйте еще раз: '))
#     elif x < numb:
#         cnt += 1
#         print('Твое число слишком большое')
#         numb = int(input('Попробуйте еще раз: '))
#     else:
#         cnt += 1
#         print(f'Отлично, {name}! Ты справилься! Количество попыток: {cnt}.')
#         break

##  Урок четвертый, домашнее задание №8
'''
8) Многие спортсмены жаловались, что судья слишком тихо отсчитывает секунды, оставшиеся до старта («Три!.. Два!.. Один!..»).
Фирма Go Ahead купила табло для наглядного отображения оставшегося времени.
Запрограммируйте табло так, чтобы оно по порядку печатало, сколько секунд осталось
'''

# for i in range(15,-1,-1):
#     print(f'\r{i}', end = '')
#     sleep(1)

##  Урок четвертый, домашнее задание №9
'''
9) Вам требуется написать программу, которая выводит на экран
 все доступные счастливые билеты с подсчетом их количество. 
 Счастливым билетом называют такой билет с шестизначным номером, 
 где сумма первых трех цифр равна сумме последних трех. 
 Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
 Вам требуется написать программу, которая проверяет счастливость билета.
 и в конце выведите сколько в процентах составляют они от всего количества
'''


##  Урок четвертый, домашнее задание №10
'''
10) Составить последовательность Фибоначчи.
'''
# a = 0
# b = 1
# stop = int(input('Конечный номер Фибоначчи: '))
# print(a)
# print(b)
# for i in range(0, stop + 1):
#     f = (a + b )
#     if f >= stop:
#         break
#     print(f)
#     a = b
#     b = f

